from telebot.types import Message

from loader import bot


# Команда /highprice
# После ввода команды у пользователя запрашивается:
# 1. Город, где будет проводиться поиск.
# 2. Количество отелей, которые необходимо вывести в результате (не больше заранее определённого максимума).
# 3. Необходимость загрузки и вывода фотографий для каждого отеля (“Да/Нет”)
#   a. При положительном ответе пользователь также вводит количество необходимых фотографий (не больше заранее
#   определённого максимума)

@bot.message_handler(commands=['highprice'])
def lowprice(message: Message):
    bot.reply_to(message, 'highprice')
